# SetPlaneReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnPlane..::..SetPlaneReference Method
PointOnPlane Class See Also
---
Change the geometric plane reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetPlaneReference(
	Reference planeReference
)
```

Visual Basic
---
```text
Public Sub SetPlaneReference ( _
	planeReference As Reference _
)
```

Visual C++
---
```text
public:
void SetPlaneReference(
	Reference^ planeReference
)
```

# ### Parameters
planeReference
    Type: Autodesk.Revit.DB..::..ReferenceA reference to some plane in the document. (Note: the reference must satisfy IsValidPlaneReference(), but this is not checked until this PointOnPlane object is assigned to a ReferencePoint.)
# See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace